src/Catalogs/ПоказателиБюджетов/ПоказателиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиБюджетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресАналитикиКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаВалюты</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаЕдиницыИзмерения</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОпределяетсяАналитикой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресАналитикиВалюта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияОпределяетсяАналитикой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики6</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИспользуемыхАналитик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПоВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПоКоличеству</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ПоказателиБюджетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращаемое значение:
//   см. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("ВидАналитики1");
	Результат.Добавить("ВидАналитики2");
	Результат.Добавить("ВидАналитики3");
	Результат.Добавить("ВидАналитики4");
	Результат.Добавить("ВидАналитики5");
	Результат.Добавить("ВидАналитики6");
	Результат.Добавить("УчитыватьПоКоличеству");
	Результат.Добавить("УчитыватьПоВалюте");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Обработчик обновления УП 2.0.4.6
//
Процедура ЗаполнитьПараметрыКоличественногоИВалютногоУчета() Экспорт
	
	Выборка = Справочники.ПоказателиБюджетов.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ПолучитьОбъект();
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект,,Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
